'use strict';

const Controller = require('egg').Controller;

class HomeController extends Controller {
  async kjnavlist() {
    const { ctx } = this;
    let kjnavlist=[
        {
            name:'客厅'
        },
        {
            name:'卧室'
        },
        {
            name:'厨房'
        },
        {
            name:'卫生间'
        },
        {
            name:'阳台'
        },
        {
            name:'全屋'
        }
    ]
    ctx.body = kjnavlist;
  }
// 客厅
  async ketinglist() {
    const { ctx } = this;
    let ketinglist=[
      [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/livingroom-01.73a29a9.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/livingroom-02.8bc1085.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/livingroom-03.1e4fe43.jpg'
        }
      ],
      [
        {
            text:'1、电路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：中大元通'
        },
        {
            text:'单芯电线φ16或φ20PVC管铺设，所有老线必须更换；部分预埋线管可利用；每根管内穿线不超过线管截面积的40%；管内电线不得有接头；不含中央空调总线；插座及电源采用2.5平方线，灯位控制线采用1.5线，客厅3P以上立柜空调采用4平方线；单管单线每平米加35元。'
        },
        {
            text:'2、地砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'含辅材和人工铺贴(仅含地面从一边起整块正铺，如因客户特殊需求非正常一边起整块正铺而产生的损耗，由客户承担)不含走边及地面拼花、斜铺，如需走边、拼花、斜铺等，费用另计；不含主材；水泥砂浆层超过4cm另计找平费用。'
        },
        {
            text:'3、地面找平',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'综合价，厚度在4cm以内不做调整，超过4cm费用另计。'
        },
        {
            text:'4、顶面乳胶漆',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：多乐士'
        },
        {
            text:'客厅、房间顶面基层清理干净，粉刷石膏找平，打磨平整，批刮环保家装耐水光面腻子2-3遍。'
        },
        {
            text:'5、墙面乳胶漆',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：多乐士'
        },
        {
            text:'墙面基层清理干净，粉刷石膏找平，批刮环保家装耐水光面腻子2-3遍，打磨平整，贴网格布及基础找平；涂刷高度限2.8米；阴阳角角护线铺设。'
        },
        {
            text:'6、石膏板平吊顶',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：圣戈班杰科'
        },
        {
            text:'玄关过道平顶吊顶；客餐厅直线“回”字平顶吊顶(300mm以内)；中央空调单边平顶吊顶(600mm以内)；纸面石膏板封面，木龙骨基层；木龙骨做防火涂刷处理。'
        },
        {
            text:'7、空调出风口',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:' 细木工板基础'
        },
        {
            text:'8、门套打底',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'细木工板基础'
        }
       ],
       [
        {
            text:'1、地砖   ',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:' 若改为与房间一致的地板，费用另计'
        },
        {
            text:'2、地砖踢脚线',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'地砖配套，同颜色地砖加工100mm之内（含100mm）踢脚线或可换成制定型号8cm复合实木踢脚线'
        },
        {
            text:'3、入户门成品实木复合单门套',
            type:0
        },
        {
            text:'单位：㎡ 数量： 1 品牌：丰德/梦天'
        }
      ]
    ]
    ctx.body = ketinglist;
  }
//卧室
async woshilist() {
    const { ctx } = this;
    let woshilist=[
    [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bedroom-01.abe47ad.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bedroom-02.440bed0.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bedroom-03.0d993b8.jpg'
        }
    ],
    [
        {
            text:'1、电路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：中大元通'
        },
        {
            text:'单芯电线φ16或φ20PVC管铺设，所有老线必须更换；部分预埋线管可利用；每根管内穿线不超过线管截面积的40%；管内电线不得有接头；不含中央空调总线；插座及电源采用2.5平方线，灯位控制线采用1.5线，客厅3P以上立柜空调采用4平方线；单管单线每平米加35元。'
        },
        {
            text:'2、地面找平',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'综合价，厚度在4cm以内不做调整，超过4cm费用另计。'
        },
        {
            text:'3、顶面乳胶漆',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：多乐士'
        },
        {
            text:'客厅、房间顶面基层清理干净，粉刷石膏找平，批刮环保，家装耐水光面腻子2-3遍，打磨平整，贴网格布用基础找平。'
        },
        {
            text:'4、墙面乳胶漆',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：多乐士'
        },
        {
            text:'墙面基层清理干净，粉刷石膏找平，批刮环保家装耐水光面腻子2-3遍，打磨平整，贴网格布及基础找平；涂刷高度限2.8米；阴阳角角护线铺设。'
        },
        {
            text:'5、空调出风口',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:' 细木工板基础'
        },
        {
            text:'6、石膏线走圈',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'8-10cm石膏线，特殊加宽费用另计'
        },
        {
            text:'7、门套打底',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'细木工板基础'
        }
    ],
    [
        {
            text:'1、地砖   ',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：安信/生活家/东鹏/箭牌/自然密码/Camel'
        },
        {
            text:' 含主材、打单层地垄、人工铺设费用。'
        },
        {
            text:'2、地砖踢脚线',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'地砖配套'
        },
        {
            text:'3、卧室门',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：丰德/梦天'
        },
        {
            text:'含门及门套；房门标准尺寸：2050高*850宽*45mm厚（每项超出按20元/cm收费），双开门按2倍计算；子母门按标准门的1.7倍计算。'
        },
        {
            text:'4、门锁五金',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：名门/汇泰龙'
        },
        {
            text:'含合页、门吸、门锁整套系统'
        }
    ]
    ]
    ctx.body = woshilist;
}
//厨房
  async chufanglist() {
    const { ctx } = this;
    let chufanglist=[
      [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/kitchen-01.92c08f7.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/kitchen-02.9f3c588.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/kitchen-03.9a8c925.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/kitchen-04.6e5117d.jpg'
        }
      ],
      [
        {
            text:'1、电路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：中大元通'
        },
        {
            text:'单芯电线φ16或φ20PVC管铺设，所有老线必须更换；部分预埋线管可利用；每根管内穿线不超过线管截面积的40%；管内电线不得有接头；不含中央空调总线；插座及电源采用2.5平方线，灯位控制线采用1.5线，客厅3P以上立柜空调采用4平方线；单管单线每平米加35元。'
        },
        {
            text:'2、水路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：伟星'
        },
        {
            text:' PPRφ25合金水管铺设，水管从顶面走，包括过梁打孔（如客户书面提出要求不做吊顶，可从地面走水管）；不包含屋顶水箱管道，锅炉暖气片供水，净水或循环系统回路，太阳能热水器管道，水表移位；阳台通水仅含一个冷水（不含热水），若需做热水及两个或两面个以上阳台通水，增加部分费用另加。'
        },
        {
            text:'3、包管道',
            type:0
        },
        {
            text:' 单位：条 数量： 不限 品牌：多乐士'
        },
        {
            text:'砖或木工板封管，不含饰面，含静音处理。'
        },
        {
            text:'4、地砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'含辅材和人工铺贴(仅含地面从一边起整块正铺，如因客户特殊需求非正常一边起整块正铺而产生的损耗，由客户承担)不含走边及地面拼花、斜铺，如需走边、拼花、斜铺等，费用另计；不含主材；水泥砂浆层超过4cm另计找平费用。'
        },
        {
            text:'5、墙砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'卫生间、厨房、阳台墙砖铺贴，水泥砂浆铺贴，铺设高度为2.4米之内，不含走边及拼花、斜铺；规格小于300*300mm的砖费用另计。'
        },
        {
            text:'6、墙地面防水处理',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'卫生间防水涂料二遍，墙面涂刷高度1.8米；厨房阳台防水涂料涂刷，厨房墙面涂刷高度1米，阳台墙面涂刷高度0.3米。'
        },
        {
            text:'7、门套打底',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'细木工板基础'
        }
       ],
       [
        {
            text:'1、整体橱柜',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：欧琳/东鹏/箭牌/欧睿宇邦'
        },
        {
            text:'含地柜、吊柜、台面。地柜长度按建筑面积*0.03计算（最低3米起），吊柜长度为地柜长度*0.5；超出地柜及台面按2480元/延米，增加吊柜按800元/延米；配套碗篮一只，调味篮一只；不含抽屉。'
        },
        {
            text:'2、水槽及水槽龙头',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：摩恩/东鹏/箭牌/四维'
        },
        {
            text:'3、集成吊顶',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：楚楚/东鹏/箭牌/奥普',
            
        },
        {
            text:'4、LED平板灯',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：楚楚/东鹏/箭牌/奥普'
        },
        {
            text:'集成吊顶配套'
        },
        {
            text:'5、地砖',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'规格300×300；更换规格，费用另计'
        },
        {
            text:' 6、墙砖',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'7、金属移门',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：丰德/韦天'
        },
        {
            text:'每套房含3.2平米，如超出平方数，按2180元/平米计算；移门和门套可变为一樘油漆门。'
        },
        {
            text:'8、门套',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：丰德/韦天'
        },
        {
            text:'实木复合门套。'
        },
        {
            text:'9、门锁五金',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：名门/汇泰龙'
        },
        {
            text:'含合页、门吸、门锁整套系统。'
        }
      ]
    ]
    ctx.body = chufanglist;
  }
//卫生间
  async weishenglist() {
    const { ctx } = this;
    let weishenglist=[
      [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bathroom-01.6f0dc59.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bathroom-02.3e2448b.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bathroom-03.80d2719.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bathroom-04.ad77ce3.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/bathroom-05.0a484a3.jpg'
        }
      ],
      [
        {
            text:'1、电路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：中大元通'
        },
        {
            text:'单芯电线φ16或φ20PVC管铺设，所有老线必须更换；部分预埋线管可利用；每根管内穿线不超过线管截面积的40%；管内电线不得有接头；不含中央空调总线；插座及电源采用2.5平方线，灯位控制线采用1.5线，客厅3P以上立柜空调采用4平方线；单管单线每平米加35元。'
        },
        {
            text:'2、水路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：伟星'
        },
        {
            text:' PPRφ25合金水管铺设，水管从顶面走，包括过梁打孔（如客户书面提出要求不做吊顶，可从地面走水管）；不包含屋顶水箱管道，锅炉暖气片供水，净水或循环系统回路，太阳能热水器管道，水表移位；阳台通水仅含一个冷水（不含热水），若需做热水及两个或两面个以上阳台通水，增加部分费用另加。'
        },
        {
            text:'3、包管道',
            type:0
        },
        {
            text:' 单位：条 数量： 不限 品牌：多乐士'
        },
        {
            text:'砖或木工板封管，不含饰面，含静音处理。'
        },
        {
            text:'4、地砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'含辅材和人工铺贴(仅含地面从一边起整块正铺，如因客户特殊需求非正常一边起整块正铺而产生的损耗，由客户承担)不含走边及地面拼花、斜铺，如需走边、拼花、斜铺等，费用另计；不含主材；水泥砂浆层超过4cm另计找平费用。'
        },
        {
            text:'5、墙砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'卫生间、厨房、阳台墙砖铺贴，水泥砂浆铺贴，铺设高度为2.4米之内，不含走边及拼花、斜铺；规格小于300*300mm的砖费用另计。'
        },
        {
            text:'6、墙地面防水处理',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'卫生间防水涂料二遍，墙面涂刷高度1.8米；厨房阳台防水涂料涂刷，厨房墙面涂刷高度1米，阳台墙面涂刷高度0.3米。'
        },
        {
            text:'7、门套打底',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'细木工板基础'
        }
       ],
       [
        {
            text:'1、地砖',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'规格300×300；更换规格，费用另计'
        },
        {
            text:'2、墙砖',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'3、坐便器',
            type:0
        },
        {
            text:'单位：只 数量： 1 品牌：TOTO/科勒/美标/箭牌/四维',
            
        },
        {
            text:'可升级为智能盖板或智能座便器，费用另计。',
            
        },
        {
            text:'4、浴室柜',
            type:0
        },
        {
            text:'单位：套 数量： 不限 品牌：欧路莎/箭牌/东鹏/苏杭/四维'
        },
        {
            text:'柜体限1.2m之内，超出部分按1800元/延米计算'
        },
        {
            text:'5、台盆龙头',
            type:0
        },
        {
            text:'单位：个 数量： 1 品牌：TOTO/科勒/美标/箭牌/四维'
        },
        {
            text:'柜体限1.2m之内，超出部分按1800元/延米计算'
        },
        {
            text:'6、台盆',
            type:0
        },
        {
            text:'单位：个 数量： 1 品牌：TOTO/科勒/美标/箭牌/四维'
        },
        {
            text:'7、淋浴房',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：箭牌/四维'
        },
        {
            text:'900*900扇形或3平米之内一字型，超出部分按980元/平米计算，非标另计。'
        },
        {
            text:'8、淋浴花洒',
            type:0
        },
        {
            text:'单位：个 数量： 1 品牌：TOTO/科勒/美标/箭牌/四维'
        },
        {
            text:'带顶喷的淋浴花洒。'
        },
        {
            text:'9、集成吊顶',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：楚楚/东鹏/箭牌/奥普'
        },
        {
            text:'10、LED平板灯',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：楚楚/东鹏/箭牌/奥普',
            
        },
        {
            text:'集成吊顶配套。'
        },
        {
            text:'11、暖风机',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：楚楚/东鹏/箭牌/奥普'
        },
        {
            text:'集成吊顶配套。'
        },
        {
            text:'12、卫浴五金',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：摩恩/东鹏/箭牌'
        },
        {
            text:'含毛巾单杆、浴巾架、厕纸盒、马桶刷四件套。'
        },
        {
            text:'13、地漏',
            type:0
        },
        {
            text:'单位：只 数量： 2 品牌：潜水艇'
        },
        {
            text:'卫生间2个地漏，阳台一个地漏。'
        },
        {
            text:'14、卫生间门',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：丰德/梦天'
        },
        {
            text:'含门及门套；房门标准尺寸：2050高*850宽*45mm厚（每项超出按20元/cm收费），双开门按2倍计算；子母门按标准门的1.7倍计算。如加玻璃，增加150元/套'
        },
        {
            text:'15、门锁五金',
            type:0
        },
        {
            text:'单位：套 数量： 1 品牌：名门/汇泰龙'
        },
        {
            text:'含合页、门吸、门锁整套系统。'
        }
      ]
    ]
    ctx.body = weishenglist;
  }
//阳台
  async yangtailist() {
    const { ctx } = this;
    let yangtailist=[
      [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/balcony-01.c145543.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/balcony-02.b81eb0f.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/balcony-03.85ead83.jpg'
        }
      ],
      [
        {   
            text:'1、电路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：中大元通'
        },
        {
            text:'单芯电线φ16或φ20PVC管铺设，所有老线必须更换；部分预埋线管可利用；每根管内穿线不超过线管截面积的40%；管内电线不得有接头；不含中央空调总线；插座及电源采用2.5平方线，灯位控制线采用1.5线，客厅3P以上立柜空调采用4平方线；单管单线每平米加35元。'
        },
        {
            text:'2、水路铺设',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：伟星'
        },
        {
            text:' PPRφ25合金水管铺设，水管从顶面走，包括过梁打孔（如客户书面提出要求不做吊顶，可从地面走水管）；不包含屋顶水箱管道，锅炉暖气片供水，净水或循环系统回路，太阳能热水器管道，水表移位；阳台通水仅含一个冷水（不含热水），若需做热水及两个或两面个以上阳台通水，增加部分费用另加。'
        },
        {
            text:'3、包管道',
            type:0
        },
        {
            text:' 单位：条 数量： 不限 品牌：多乐士'
        },
        {
            text:'砖或木工板封管，不含饰面，含静音处理。'
        },
        {
            text:'4、地砖铺贴',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'含辅材和人工铺贴(仅含地面从一边起整块正铺，如因客户特殊需求非正常一边起整块正铺而产生的损耗，由客户承担)不含走边及地面拼花、斜铺，如需走边、拼花、斜铺等，费用另计；不含主材；水泥砂浆层超过4cm另计找平费用。'
        },
        {
            text:'5、墙地面防水处理',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'卫生间防水涂料二遍，墙面涂刷高度1.8米；厨房阳台防水涂料涂刷，厨房墙面涂刷高度1米，阳台墙面涂刷高度0.3米。'
        },
        {
            text:'6、门套打底',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：兔宝宝'
        },
        {
            text:'细木工板基础'
        }
       ],
       [
        {
            text:'1、地砖',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'规格300×300；更换规格，费用另计'
        },
        {
            text:'2、地砖踢脚线',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：金意陶/东鹏/箭牌/欧神诺'
        },
        {
            text:'地砖配套'
        },
        {
            text:'3、地漏',
            type:0
        },
        {
            text:'单位：只 数量： 2 品牌：潜水艇'
        },
        {
            text:'卫生间2个地漏，阳台一个地漏。'
        }
      ]
    ]
    ctx.body = yangtailist;
  }
//全屋
async quanwulist() {
    const { ctx } = this;
    let quanwulist=[
      [
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/houses-01.45eb770.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/houses-02.1cc0187.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/houses-03.8333d04.jpg'
        },
        {
            imgUrl:'https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/houses-04.44417c9.jpg'
        }
      ],
      [
        {
            text:'1、窗台石铺贴',
            type:0
        },
        {
            text:'单位：M 数量： 不限 品牌：'
        },
        {
            text:'水泥砂浆铺贴。'
        },
        {
            text:'2、门槛石铺贴',
            type:0
        },
        {
            text:'单位：M 数量： 不限 品牌：'
        },
        {
            text:'水泥砂浆铺贴。'
        },
        {
            text:'3、开关插座',
            type:0
        },
        {
            text:'单位：个 数量： 按平米计 品牌：'
        },
        {
            text:'100平米以下包含60个开关插座（开关点位+插座点位=60），超出100平米以上每5平米增加一个开关插座；含面板安装。'
        },
        {
            text:'4、全屋网格布',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'5、垃圾搬运',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'从装修房到小区物业指定点，垃圾外运出小区费用另计。'
        },
        {
            text:'6、材料搬运',
            type:0
        },
        {
            text:'单位：㎡ 数量： 不限 品牌：'
        },
        {
            text:'指电梯可使用情况下，电梯不能使用费用另计，不含客户自购材料搬运'
        },
        {
            text:'7、地面保护',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：'
        },
        {
            text:'地面保护剂。'
        },
         {
            text:' 8、成品保护费',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：'
        },
        {
            text:'专用保护膜。'
        },
        {
            text:'9、装潢垃圾袋',
            type:0
        },
        {
            text:'单位：只 数量： 不限 品牌：'
        },
        {
            text:'10、五金洁具安装',
            type:0
        },
        {
            text:' 单位：个 数量： 不限 品牌：'
        },
        {
            text:'不含淋浴房、浴缸；不含特殊工艺五金洁具安装。'
        },
        {
            text:'11、灯具安装',
            type:0
        },
        {
            text:'单位：个 数量： 不限 品牌：'
        },
        {
            text:' 筒灯、射灯、普通吸顶灯、壁灯及灯带安装，不限个数（不含吊灯）。'
        },
        {
            text:'12、完工家政',
            type:0
        },
        {
            text:' 单位：次 数量： 1 品牌：'
        },
        {
            text:'全屋开荒清洁一次。'
        },
       ],
       [
        {
            text:'1、开关插座',
            type:0
        },
        {
            text:'单位：个 数量： 按平方计 品牌：西门子（品宜系列）'
        },
        {
            text:'100平米以下包含60个开关插座（开关+插座=60），超出100平米以上每5平米增加一个开关插座。客厅2个网络接口，房间各含一个网络接口、一个电视接口，不含地插。'
        },
        {
            text:'2、窗台石',
            type:0
        },
        {
            text:'单位：㎡ 数量： 按平方计 品牌：'
        },
        {
            text:'浅咖网纹/新西米黄,规格宽度200mm以内，建筑面积/20作为门槛总长度。单个石材长度超过1800mm需要分2块拼接。',
            
        },
        {
            text:'3、门槛石',
            type:0
        },
        {
            text:'单位：㎡ 数量： 按平方计 品牌：',
        },
        {
            text:' 浅咖网纹/新西米黄,规格宽度200mm以内，建筑面积/20作为门槛总长度。单个石材长度超过1800mm需要分2块拼接。',
        },
        {
            text:'4、飘窗',
            type:0
        },
        {
            text:'单位：㎡ 数量： 按平方计 品牌：'
        },
        {
            text:'浅咖网纹/新西米黄,110平方以下含一个飘窗。11平方以上含2个飘窗。'
        },
      ]
    ]
    ctx.body = quanwulist;
  }







}

module.exports = HomeController;
