<template>
  <div class="box">
    <header>
      <img src="https://cdn-prod.z11.ren/zaojia-ui/2.0.0/static/img/banner.ca24520.jpg" alt="">
    </header>
    <main  v-show="isshow == 1">
      <div class="main">
        <div class="l">
          <div class="con">
            <ul>
              <li @click="isshows(1)" :class="[isshow==1?'on':'']">补充说明</li>
              <li @click="isshows(2)" :class="[isshow==2?'on':'']">客户配合</li>
              <li @click="isshows(3)" :class="[isshow==3?'on':'']">套餐说明</li>
            </ul>
          </div>
        </div>
        <div class="r">
          <p>补充说明</p>
          <ul>
            <li>1、公司任何员工给客户的承诺以盖公章的书面说明为准,任何口头承诺均无效。</li>
            <li>2、预算外项目增加款要交到公司，严禁与项目经理私自交易；严禁把工程款或增加款交给项目经理（持财务委托书除外）否则因此带来的损失由客户自行承担。</li>
            <li>一、安全工作交底</li>
            <li>1、 临时用电、工具安全：</li>
            <li>1) 工地施工用电必须经过临时电箱，临时电箱必须接地并配备漏电保护功能。</li>
            <li>七、施工技术交底</li>
            <li> 3、预算内项目开工后甲方不允许减项，如要减项，加收10%管理费。</li>
            <li>4、预算外增加项目未签定联系单和未将增加款打到公司的，不在公司保修、维修范围之内。</li>
            <li>5、客户自购材料，对其质量所引起的一切后果公司概不负责，同时不在公司保修、维修范围之内。</li>
            <li> 6、申请装修许可证、楼道维护费等其他物业管理费、装修押金等均由客户支付。如由公司施工人员造成小区内设施、设备损坏,由公司承担。</li>
            <li>7、施工中如遇打拆墙及涉及消防因素的专案，必须由业主向有关部门申请，费用由业主自理，在审批中双方必须严格按国家有关规定办理，任何一方不得强行违反国家有关规定，以免造成双方损失。</li>
            <li> 8、本工程预算造价未包含发票税金，开具发票时由客户自理发票税金。</li>
            <li> 9、本预算所有家具柜内若无特殊说明，均不考虑贴波音软片或防火板，若业主要求，贴防火板以36.6元/平方米计，贴波音软片25.2元/平方米；</li>
            <li>预算特殊注明除外。客户要求做防火涂料加7.5元/平方。</li>
            <li>10、该预算中搬运费以电梯可使用的情况为准。若不可使用或需要吊装产生的额外费用，则需另行增加费用；预算内黄沙、水泥、拆除、吊装、现浇楼板等按常规市场价计算，如遇到小区服务商垄断强行加价，费用由客户按实补差或出面协调让乙方材料及人员进场。</li>
            <li>11、此预算不含打空调洞、油烟机、水管过梁洞等。</li>
            <li>12、导线用中大元通BV电线穿PVC管暗敷，电视线为双音频线，电脑线为八芯线、均为国产，穿PVC管暗敷，冷热水管用伟星PPR水管，PPR水管主管均为6分管,支管为4分管。</li>
            <li>13、家具类等木材面油漆、墙面乳胶漆品牌客户不得随意变更和自购，如确需更换品牌的按公司定价变更（油漆以每桶增（减）价格计算）；所购材料质量必须得到乙方认可。</li>
            <li>14、衣柜主材用饰面板，框架用杉木趾接板立框，后壁用九厘香樟面板,抽屉旁板用1.5杉木集成板，抽屉底板用九厘香樟面板,门板反面用三夹板或普通面板代替,均用实木封边。其他柜体主材用饰面板，框架用细木工板立框，后壁用九厘板,抽屉旁板用1.5杉木集成板，抽屉底板用九厘香樟面板,门板反面用三夹板或普通面板代替,均用实木封边。</li>
            <li> 15、 灯位线用1.5平方，普通插座线用2.5平方，每只空调采用独立线路，3P立柜空调用4平方线。速热热水器采用4平方线，加价2.2元/米。</li>
            <li> 16、开放式套色加23.9元/平方；添加黑筋或白筋的休闲开放漆加30.9元/平方；封闭式面着色加37.9元/平方（以上套色含喷漆）</li>
            <li> 17、如施工过程中实际工程量与预算有出入，则按实际工程量计算，原预算基价不变；图纸中具体施工项目以预算为准。</li>
            <li>18、客户在施工期间应免费提供水、电等施工设施，以及楼道畅通和居民与物业公司的协调工作。</li>
            <li>19、环保检测必须在客户自购地板、家具、窗帘、沙发等未进场之前进行，如擅自进场后，环保检测不合格，公司不予承担。</li>
            <li>20、本项目施工合同工期为全天施工日，若小区特殊规定节假日，周六，周日不予施工，或小区停水停电等其他因素导致不能施工则工期相应顺延。本工程施工按照水电验收----泥工先线槽修补砌好墙后、木工进场交叉施工验收----油漆施工的顺序施工，若客户要求泥工工程全部做好再木工进场，则工期须相应延长。</li>
            <li>21、如预算中产品更换必须在产品下单前通知本公司并取得书面同意，否则造成后果由客户承担，如更换预算外的产品必须补产品差价。</li>
            <li>22、预算中未详细标明的施工工艺及用材按行业常规标准。</li>
          </ul>
        </div>
      </div>
    </main>
    <main class="main2"  v-show="isshow == 2">
      <div class="main">
        <div class="l">
          <div class="con">
            <ul>
              <li @click="isshows(1)" :class="[isshow==1?'on':'']">补充说明</li>
              <li @click="isshows(2)" :class="[isshow==2?'on':'']">客户配合</li>
              <li @click="isshows(3)" :class="[isshow==3?'on':'']">套餐说明</li>
            </ul>
          </div>
        </div>
        <div class="r">
          <p>客户配合</p>
          <ul>
            <li>1、开工进场我们需要进行公司形象牌张贴，墙体改动实地放样，卫生间养水测试，检查原结构的质量和门窗是否完好。</li>
            <li>2、养水测试及原结构交接需业主签字。</li>
            <li> 3、在水电开工准备阶段到水电中期前，业主应把浴缸、淋浴房、热水器、锅炉等尺寸告诉项目经理。</li>
            <li>  4、开工需要业主到场放样；水电材料进场需要业主验收。</li>
            <li> 5、如做中央空调等集成家居的，在水电前期把它们做好。</li>
            <li>6、水电工程完工需要业主到场验收。</li>
            <li>7、泥工阶段的卫生间、厨房间、阳台、客厅墙地砖、淋浴房人造石门槛等需要业主到场验收。</li>
            <li>8、在水电验收合格到木材进场前，需要业主挑选、确认饰面板。</li>
            <li>9、泥工中期需要业主把塑钢窗、包阳台叫人做好。</li>
            <li>10、泥工工程完工需要业主到场验收。</li>
            <li>11、木材进场需要业主验收。</li>
            <li> 12、木工中期需要业主进行木工框架初步验收。</li>
            <li>13、木工工程完工需要业主到场验收。</li>
            <li>14、油漆进场前需要业主对饰面板是否套色及套什么颜色最后确认。</li>
            <li> 15、油漆材料进场需要业主验收。</li>
            <li> 16、油漆中期，墙面基层做好之前，墙面乳胶漆颜色、哪部份墙面贴墙纸需要业主最后确认。</li>
            <li>17、浴霸、换气扇、煤气灶、油烟机、消毒柜、拉蓝、米箱、调味架、水槽、台盆、门锁、暗拉手、门套线、脚线、房门、铝扣板等五金、洁具、龙头、开关插座、拉手、卫生间挂件、镜子、整体梳洗台等需要业主到场验收。</li>

            <li> 18、油漆后期、地板铺设之前，业主应把灯具送到施工现场。</li>
            <li>19、包安装的商品由业主联系商家上门安装。</li>
            <li>20、安装工程阶段，这时需要业主更积极的配合，卫生间挂件安装位置需要业主确认。</li>
            <li>21、工程竣工验收需要业主到场。</li>
            <li> 22、公司设计师配合软装饰选购。</li>
          </ul>
        </div>
      </div>
    </main>
    <main class="m3"  v-show="isshow == 3">
      <div class="main">
        <div class="l">
          <div class="con">
            <ul>
              <li @click="isshows(1)" :class="[isshow==1?'on':'']">补充说明</li>
              <li @click="isshows(2)" :class="[isshow==2?'on':'']">客户配合</li>
              <li @click="isshows(3)" :class="[isshow==3?'on':'']">套餐说明</li>
            </ul>
          </div>
        </div>
        <div class="r r3" >
          <p>套餐说明</p>
          <ul>
            <li>(一)面积及计价方式</li>
            <li>1、本套餐适用于70~140㎡户型；不足90㎡按90㎡计算，每少1平方减800元，最低按70平方为准（最低减到70平方，低于70平方不再减），超出140㎡户型</li>
            <li>不适用本套餐，需另外报价。</li>
            <li>2、110㎡以下户型含2室1厨1卫1阳台，110㎡以上户型含3室1厨2卫2阳台，超出部分需按个性化项目计价收费。</li>
            <li>3、建筑面积：房屋统一按照外框面积计价，其中飘窗按全面积计算，单个阳台或露台大于10平方按照一半面积计算；阁楼平均层高1800mm以下按三分之二</li>
            <li>面积计算，阁楼或loft户型中空部分面积不计入套餐面积，中空区域水电施工及墙体乳胶漆费用另计。</li>
            <li>(二)套餐不含项目说明</li>
            <li>1、此套餐不含税费，税费另计。</li>
            <li>2、此套餐不含墙面抗裂高级处理和特殊墙面处理（如水灰墙、保温墙面、基层找平等）。</li>
            <li>3、此套餐不含电器、及其自购产品的安装，及个性化改造部分。</li>
            <li> 4、此套餐不含阳台墙砖、阳台外墙涂料、垃圾外运等。</li>
            <li>5、此套餐不含所有新建和拆除项目（如新增门、门套及门套线、柜、窗套及窗套线、隔断、吊顶、背景墙、新建墙体等；房屋原有建筑设计的改造、移位
              、拆除等）。</li>
          </ul>
        </div>
      </div>
    </main>
  </div>
</template>

<script>
  export default {
    name: "",
    data(){
      return{
        isshow:1
      }
    },
    mounted(){
      //
    },
    computed:{

    },
    methods: {
      isshows(num){
        this.isshow = num
      }
    }

  }
</script>

<style lang="less" scoped>
  .main2{
    height: 900px!important;
    .main{
      height: 800px!important;
    }
  }
  .m3{
    height: 600px!important;
    .main{
      height: 500px!important;
    }
  }
.box{
  width: 100%;
  header{
    img{
      width: 100%;
      height: 556px;
    }
  }
  main{
    width: 100%;
    background: #F4F7F7;
    height: 1200px;
    .main{
      width: 1200px;
      margin: auto;
      background: white;
      height: 1100px;
      .l{
        width: 300px;
        float: left;
        .con{
          width: 280px;
          height: 340px;
          background: #49C5B6;
          ul{
            color: white;
            li{
              cursor:pointer;
              height: 60px;
              line-height: 60px;
              text-indent: 2em;
              font-size: 18px;
              &.on{
                background: rgba(0,0,0,0.5);
              }
              &:hover{
                background: rgba(0,0,0,0.5);
              }
            }
          }
        }
      }
      .r{
        width: 900px;
        float: right;
        p{
          width: 880px;
          text-align: center;
          line-height: 110px;
          height: 110px;
          font-size: 20px;
        }
        ul{
          width: 880px;
        }
      }
    }
  }
}

</style>
